zeha/xc32/pic32m-source/binutils/ld/mchp/pic32-su-common.c
/* Code common to pic32m and pic32c for the stack usage feature.

  This file is part of the GNU Binutils.

  This program is free software; you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation; either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 51 Franklin Street - Fifth Floor, Boston,
  MA 02110-1301, USA. */

#include "sysdep.h"
#include "bfd.h"
#include "demangle.h"
#include "libbfd.h"
#include "elf-bfd.h"
#include "bfdlink.h"
#include "ld.h"
#include "ldexp.h"
#include "ldmain.h"
#include "ldlang.h"

#include <stdint.h>
#include <limits.h>

#include "pic32-vecset.h"
#if defined(TARGET_IS_PIC32C)
#include "elf/pic32.h"
#include "pic32c-emul.h"
#endif
#if defined(TARGET_IS_PIC32MX)
#include "pic32m-emul.h"
#endif
#include "pic32-stack-usage.h"
#include "mchp/pic32-su-common.h"

extern bfd_boolean pic32_debug;
extern bfd_boolean pic32_smart_io;

su_callstack *crt_callstack;    /* current call stack */

static const char *su_get_smartio_replacement (const char *);
/* TODO: This comes from pic32-stack-usage.c which is in the BFD code
   and doesn't have a header. */
void pic32_su_add_to_call_graph (bfd *, const char *, bfd_vma,
				 bfd *, const char *, bfd_vma);

/*
* Stack Usage Estimation
* 	check if r_type corresponds to a call semantic
*/
bfd_boolean is_call_reloc (unsigned int r_type);

/*
* Stack Usage Estimation
* 	find the application starting point
* 	in the stack usage list
*/
static struct su_section *
pic32_su_get_entry_point (void)
{
  struct bfd_link_hash_entry *h = NULL;

  ///\ get entry point -> Root function in call graph
 #ifdef TARGET_IS_PIC32C
  if (params.thumb_entry_symbol)
  {
    h = bfd_link_hash_lookup (link_info.hash, params.thumb_entry_symbol,
                              FALSE, FALSE, TRUE);
  }
  else
#endif
  if (entry_symbol.name != NULL)
    h = bfd_link_hash_lookup (link_info.hash, entry_symbol.name, FALSE, FALSE, TRUE);

  if (h == NULL)
    return NULL;

  return get_function_by_name_bfd (h->root.string, h->u.def.section->owner);
}

static bfd_boolean
pic32_is_PAed_function (struct su_section *node)
{
  static const char pa_fn_prefix[] = "__pa_fn_";
  return pic32_pa_enabled ()
           && !strncmp (node->fname, pa_fn_prefix, sizeof (pa_fn_prefix) - 1);
}

/*
* Stack Usage Estimation
* 	compute maximum stack usage starting from root node
*   return the max stack on the subgraph root
*   set the max_stack field for all visited nodes
*/
static uint32_t
pic32_su_max_stack (struct su_section *root)
{
  struct su_section *node;
  uint32_t index;
  uint32_t node_max = 0, tmp;
  bfd_boolean has_PAed_callees = FALSE;

  PIC32_DBG_PRINT ("pic32_su_max_stack(%s), used_stack: %u", root->fname,
                   root->used_stack);
  PIC32_DBG_PRINT (", callees: { ");
  for (index = 0; index < root->nb_callees; index++)
    PIC32_DBG_PRINT ("%s ", root->callees[index]->fname);
  PIC32_DBG_PRINT ("}\n");

  /* is it leaf function */
  if (root->callees == NULL)
    {
      return root->max_stack = root->used_stack;
    }

  /* check recursivity */
  if (root->flags & SU_PROCESSED_NODE)
    {
      /* mark recursive functions */
      mark_as_recursive (crt_callstack, root);

      /* recursivity detected */
      PIC32_DBG_PRINT ("Recursivity! Starting function: %s\n", root->fname);

      /* temporarily return the stack usage of the root function */
      return root->used_stack;
    }

  /* if the max stack usage was computed for this subgraph */
  if (root->max_stack != UINT_MAX)
    {
      return root->max_stack;
    }

  /* set SU_PROCESSED_NODE flag - processing */
  root->flags |= SU_PROCESSED_NODE;
  /* add current node in the crt callstack */
  su_cstack_push (crt_callstack, root);

  /* DFS, keeping the stack of current path */
  for (index = 0; index < root->nb_callees; index++)
    {
      node = root->callees[index];
      tmp = pic32_su_max_stack (node);
      if (tmp > node_max)
        node_max = tmp;

      /* make a note if we find any PAed callees */
      if (pic32_is_PAed_function (node))
        has_PAed_callees = TRUE;
    }

  /* the node processing finished, reset the flag */
  root->flags &= ~SU_PROCESSED_NODE;
  su_cstack_pop (crt_callstack);

  /* XC32-1683: as the PA tool is not producing any SU info at the moment,
   * conservatively assume that a call to a PAed callee uses 8 bytes of stack
   * memory (for pushing a register and keeping SP aligned to 8-bytes) */
  if (has_PAed_callees && node_max < 8)
    node_max = 8;

  root->max_stack = node_max + root->used_stack;

  return root->max_stack;
}

/* a section and its function symbols */
typedef struct {
  asection *section;
  vec_type *func_syms;
} sec_funcs;

/* adds the function symbol into the 'func_syms' vector while keeping it
 * ordered by the function addresses; multiple functions at the same address
 * are allowed (any such entries are stored in the order of appearance);
 * XC32-1631: keep a single entry in case of exact overlaps & rely on aliasing info */
void
pic32_su_add_func (vec_type         *func_syms,
                   Elf_Internal_Sym *isym)
{
  int idx = 0;
  while (idx != (int) VEC_SIZE (func_syms)
         && ST_VALUE2 (VEC (Elf_Internal_Sym*, func_syms, idx)) <= ST_VALUE2 (isym))
    ++idx;

  /* XC32-1631: add the new symbol only if a different address and/or size */
  if (!idx
      || ST_VALUE2 (VEC (Elf_Internal_Sym*, func_syms, idx - 1)) != ST_VALUE2 (isym)
      || (VEC (Elf_Internal_Sym*, func_syms, idx - 1))->st_size  != isym->st_size)
    VEC_INSERT (Elf_Internal_Sym *, func_syms, idx, isym);
}

/* returns the index of the first function (symbol) containing the specified
 * address (*MATCH is set to 1 in this case) or the index of the next func symbol /
 * the end of the function collection (*MATCH is set to 0 in this case) */
int
pic32_su_lookup_func (vec_type *func_syms,
                      int      from_idx,
                      bfd_vma  vma,
                      int      *match /*out*/)
{
  int idx = from_idx;
  while (idx != (int) VEC_SIZE (func_syms))
    {
      Elf_Internal_Sym *isym = VEC (Elf_Internal_Sym*, func_syms, idx);
      if (vma < ST_VALUE2 (isym) + isym->st_size)
        break;
      ++idx;
    }
  *match =
    idx != (int) VEC_SIZE (func_syms)
      && vma >= ST_VALUE2 (VEC (Elf_Internal_Sym *, func_syms, idx));
  return idx;
}

/* returns the functions (ordered by start addr) for the specified section */
static vec_type *
pic32_su_lookup_func_syms (vec_type *bfd_funcs,
                           asection *section)
{
  int i;
  for (i = 0; i != (int) VEC_SIZE (bfd_funcs); ++i)
    {
      sec_funcs *sf = &VEC (sec_funcs, bfd_funcs, i);
      if (sf->section == section)
        return sf->func_syms;
    }
  return NULL;
}

