zeha/xc32/pic32m-source/binutils/ld/mchp/pic32-su-common.c
/*
 * returns a vector of sec_funcs structures i.e. all the function symbols
 * from the input bfd grouped per section
 */
static vec_type *
pic32_su_get_bfd_funcs (bfd              *input_bfd,
                        Elf_Internal_Sym *isymbuf)
{
  Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (input_bfd);
  size_t symcount = symtab_hdr->sh_size / sizeof (Elf32_External_Sym);
  vec_type *bfd_funcs = VEC_NEW (sec_funcs, 0, 0);
  Elf_Internal_Sym *isym, *isymend;

  for (isym = isymbuf + 1, isymend = isymbuf + symcount; isym < isymend; ++isym)
    {
      if (ELF_ST_TYPE (isym->st_info) == STT_FUNC)
        {
          if (pic32_debug)
            {
              const char *func_name = bfd_elf_sym_name (input_bfd, symtab_hdr,
                                                        isym, NULL);
              PIC32_DBG_PRINT ("\tfunction: %s [size: 0x%0" BFD_VMA_FMT "X]%s\n",
			       func_name, isym->st_size,
			       (!isym->st_size ? "\t***** WARNING *****" : ""));
            }
          if (isym->st_size != 0)
            {
              asection *section = bfd_section_from_elf_index (input_bfd, isym->st_shndx);
              vec_type *func_syms = pic32_su_lookup_func_syms (bfd_funcs, section);
              if (!func_syms)
                {
                  sec_funcs tmp = { section, VEC_NEW (Elf_Internal_Sym *, 0, 0) };
                  VEC_PUSHBACK (sec_funcs, bfd_funcs, tmp);
                  func_syms = tmp.func_syms;
                }
              pic32_su_add_func (func_syms, isym);
            }
        }
    }

  return bfd_funcs;
}

/* free the memory used by the 'bfd_funcs' vector */
static void
pic32_su_free_bfd_funcs (vec_type *bfd_funcs)
{
  int i;
  for (i = 0; i != (int) VEC_SIZE (bfd_funcs); ++i)
    VEC_DELETE (VEC (sec_funcs, bfd_funcs, i).func_syms);
  VEC_DELETE (bfd_funcs);
}

struct su_name_addr {
  const char *name;
  bfd_vma    addr;

  /* these are used for caching purposes & should be inited to NULL */
  /* (the BFD is assumed to be the same) */
  asection    *section;
  bfd_vma     section_ofs;
  vec_type    *func_syms;
  int         func_idx;
  bfd_boolean first;
};

/*
 * returns TRUE (and fills 'name_addr') if it finds a function in
 * 'input_bfd' and 'section' that contains the 'section_ofs' location;
 * 'first' == TRUE means getting the first function spanning the location,
 * 'first' == FALSE, the subsequent ones, if available
 * returns FALSE if no (more) match(es) is/are found
 *
 */
static int
pic32_su_get_func_name_addr (struct su_name_addr *name_addr,
                             bfd                 *input_bfd,
                             vec_type            *bfd_funcs,
                             asection            *section,
                             bfd_vma             section_ofs,
                             bfd_boolean         first)
{
  vec_type *func_syms = FALSE;
  int func_idx = 0, found = FALSE;

  /* looking for the first symbol matching (section, section_ofs) */
  if (first)
    {
      /* if the previous search was identical, we already have the name/addr */
      if (name_addr->first
          && section == name_addr->section
          && section_ofs == name_addr->section_ofs)
        return TRUE;

      /* ok, need to search; */
      /* the first step is to find the func_syms for this section */
      func_syms = (section == name_addr->section)
                     ? name_addr->func_syms
                     : pic32_su_lookup_func_syms (bfd_funcs, section);
      if (func_syms)
        func_idx = pic32_su_lookup_func (func_syms, 0, section_ofs, &found);
    }
  else
    {
      /* looking for the next symbols matching the same (section, section_ofs) */
      /* so assert there was a previous match */
      BFD_ASSERT (section == name_addr->section
                  && section_ofs == name_addr->section_ofs
                  && name_addr->func_syms);

      func_syms = name_addr->func_syms;
      func_idx = pic32_su_lookup_func (func_syms,
                                       name_addr->func_idx + 1,
                                       section_ofs, &found);
    }

  if (found)
    {
      Elf_Internal_Sym *isym = VEC (Elf_Internal_Sym *, func_syms, func_idx);
      name_addr->name = bfd_elf_sym_name (input_bfd, &elf_symtab_hdr (input_bfd),
                                          isym, NULL);
      name_addr->addr = section->output_section->vma
                          + section->output_offset + ST_VALUE2 (isym);
      if (first)
        {
          name_addr->section = section;
          name_addr->section_ofs = section_ofs;
          name_addr->func_syms = func_syms;
        }
      name_addr->func_idx = func_idx;
      name_addr->first = first;
      return TRUE;
    }

  return FALSE;
}

/*
 * ensures that no su_sections from 'input_bfd' remain without addresses
 * (for the case when we'll need to dump the func addresses to the map file)
 */
static void
pic32_fill_su_section_addrs (bfd              *input_bfd,
                             Elf_Internal_Sym *isymbuf)
{
  Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (input_bfd);
  size_t symcount = symtab_hdr->sh_size / sizeof (Elf32_External_Sym);
  Elf_Internal_Sym *isym, *isymend;

  for (isym = isymbuf + 1, isymend = isymbuf + symcount; isym < isymend; ++isym)
    {
      if (ELF_ST_TYPE (isym->st_info) == STT_FUNC)
        {
          asection *section = bfd_section_from_elf_index (input_bfd, isym->st_shndx);
          if (section->output_section)
            {
              const char *fname = bfd_elf_sym_name (input_bfd, symtab_hdr, isym, NULL);
              struct su_section *node = get_function_by_name_bfd (fname, input_bfd);
              if (node && !node->faddr)
                {
                  node->faddr = section->output_section->vma
                                  + section->output_offset + ST_VALUE2 (isym);
                }
            }
        }
    }
}

/*
* Stack Usage Estimation
* 	build the pseudo call-graph based on the relocation tables
*
* (Note: return value is meaningless, but because the
* RELOC_FOR_GLOBAL_SYMBOL macro can return FALSE, it returns a value.)
*/
static int
pic32_su_call_tree (void)
{
  bfd *input_bfd;

  /* XC32-1656: keep this handy so that when encountering an .init_array /
   *            .preinit_array section we can automatically add the
   *            functions referenced there as its callees */
  struct su_section *ctors_caller =
#ifdef TARGET_IS_PIC32C
    get_function_by_name_bfd ("__libc_init_array", NULL);
#else
    get_function_by_name_bfd ("__do_global_ctors_aux", NULL);
#endif

  for (input_bfd = link_info.input_bfds; input_bfd != NULL;
       input_bfd = input_bfd->link.next)
    {
      Elf_Internal_Shdr *symtab_hdr = &elf_symtab_hdr (input_bfd);
      struct elf_link_hash_entry **sym_hashes = elf_sym_hashes (input_bfd);
      Elf_Internal_Sym *isymbuf = NULL;
      vec_type *bfd_funcs = NULL;
      asection *section;

      PIC32_DBG_PRINT ("\ninput_bfd: %s\n", input_bfd->filename);

      /* read all symbols (local + global) for the current bfd */
      isymbuf =
        bfd_elf_get_elf_syms (input_bfd, symtab_hdr,
                              symtab_hdr->sh_size / sizeof (Elf32_External_Sym),
                              0, NULL, NULL, NULL);
      /* no symbols => no callers => don't bother */
      if (!isymbuf)
        continue;

      /* cache the function symbols for (all the sections of) this bfd */
      bfd_funcs = pic32_su_get_bfd_funcs (input_bfd, isymbuf);

      /* check all sections */
      for (section = input_bfd->sections; section != NULL; section = section->next)
        {
          const bfd_boolean ctors_section = ctors_caller && !(
#ifdef TARGET_IS_PIC32C
            strcmp (section->name, ".init_array")
              && strcmp (section->name, ".preinit_array")
#else
            strcmp (section->name, ".ctors")
#endif
          );
          struct su_name_addr caller = { NULL }, callee = { NULL };
          Elf_Internal_Rela *internal_relocs, *irelaend, *irela;
          vec_type *func_syms;

