zeha/xc32/pic32m-source/binutils/ld/mchp/pic32-su-common.c
          PIC32_DBG_PRINT ("\tsection: %s [size: 0x%0" BFD_VMA_FMT "X]\n",
			   section->name, section->size);

          /* regular code sections (i.e. not arrays of pointers to functions) */
          if (!ctors_section)
            {
              /* check only code sections */
              if (!(section->flags & SEC_CODE))
                continue;

              /* we should also have some function symbols for this section */
              func_syms = pic32_su_lookup_func_syms (bfd_funcs, section);
              if (!func_syms)
                continue;
            }

          /* this discarded section test is taken from lang_map () in ldlang.c */
          if ((section->output_section == NULL
                || section->output_section->owner != link_info.output_bfd)
                && (section->flags & (SEC_LINKER_CREATED | SEC_KEEP)) == 0)
            {
              int idx;

              /* mark all the su_sections from this section as discarded */
              PIC32_DBG_PRINT ("\t  discarded section; unused function(s):");
              for (idx = 0; idx != (int) VEC_SIZE (func_syms); ++idx)
                {
                  Elf_Internal_Sym *isym = VEC (Elf_Internal_Sym*, func_syms, idx);
                  const char *func_name =
                    bfd_elf_sym_name (input_bfd, symtab_hdr, isym, NULL);
                  struct su_section *su_info =
                    get_function_by_name_bfd (func_name, input_bfd);

                  if (su_info)
                    su_info->flags |= SU_DISCARDED_NODE;

                  PIC32_DBG_PRINT (" %s\n", func_name);
                }
              PIC32_DBG_PRINT ("\n");

              /* ...and that's all the processing for these sections */
              continue;
            }

          /* NOTE: always pass 'keep_memory' as TRUE because otherwise we
           *       may need to check and free() the returned buffer */
          internal_relocs =
            _bfd_elf_link_read_relocs (input_bfd, section, NULL, NULL,
                                       TRUE /*link_info.keep_memory*/);
#ifdef TARGET_IS_PIC32C
          /* no point in looking for calls in an .init_array section */
          if (!ctors_section)
            pic32c_su_calls_wo_relocs_in_section (input_bfd, symtab_hdr, section,
                                                  internal_relocs, isymbuf, func_syms);
#endif
          if (internal_relocs == NULL)
            continue;

          /* Now examine each relocation.  */
          irela = internal_relocs;
          irelaend = irela + section->reloc_count;
          for (; irela < irelaend; irela++)
            {
              asection *callee_sec;
              unsigned int r_type, r_indx;

              r_type = ELF32_R_TYPE (irela->r_info);
              r_indx = ELF32_R_SYM (irela->r_info);

              if (!(is_call_reloc (r_type) || ctors_section))
                continue;

              /* relocation against a global symbol? */
              if (r_indx >= symtab_hdr->sh_info)
                {
                  struct elf_link_hash_entry *hash_entry = NULL;
                  bfd_boolean unresolved_reloc = FALSE;
                  __attribute__((unused)) bfd_vma relocation;
                  __attribute__((unused)) bfd_boolean warned, ignored;

                  RELOC_FOR_GLOBAL_SYMBOL ((&link_info), input_bfd, section, irela,
                                           r_indx, symtab_hdr, sym_hashes,
                                           hash_entry, callee_sec, relocation,
                                           unresolved_reloc, warned, ignored);

                  /* basically ignore the non-function symbols (although there
                   * are some functions symbols in the math library (libm)
                   * marked as STT_OBJECT, so allow that type as well) */
                  if (unresolved_reloc
                      || !(callee_sec->flags & SEC_CODE)
                      || (hash_entry->type != STT_FUNC
                          && hash_entry->type != STT_OBJECT))
                    continue;

                  if ((hash_entry->root.type != bfd_link_hash_defined) &&
                      (hash_entry->root.type != bfd_link_hash_defweak))
                    continue;

                  BFD_ASSERT (callee_sec);

                  callee.name = hash_entry->root.root.string;
                  if (pic32_smart_io)
                    callee.name = su_get_smartio_replacement (callee.name);
                  callee.addr = hash_entry->root.u.def.section->vma
                                  + hash_entry->root.u.def.value;
                }
              else
                {
                  /* relocation against a local symbol */
                  Elf_Internal_Sym *isym = isymbuf + r_indx;
                  bfd_vma sec_ofs = ST_VALUE2 (isym)
                                      + pic32_su_rel_addend (input_bfd, section,
                                                             irela, isym);
                  callee_sec = bfd_section_from_elf_index (input_bfd, isym->st_shndx);

                  BFD_ASSERT (callee_sec);

                  if (!(callee_sec->flags & SEC_CODE))
                    continue;

                  if (!pic32_su_get_func_name_addr (&callee, input_bfd, bfd_funcs,
                                                    callee_sec, sec_ofs, TRUE))
                    {
                      PIC32_DBG_PRINT ("No function found in section %s @ ofs %"
				       BFD_VMA_FMT "u\n", callee_sec->name, sec_ofs);
                      continue;
                    }

                  /* ignore the "calls" that don't correspond precisely to the
                   * beginning of a function; most likely these are just jumps
                   * (esp. on MIPS) but (without this check) they're seen as
                   * recursive calls! */
                  if (ST_VALUE2 (VEC (Elf_Internal_Sym *,
                      callee.func_syms, callee.func_idx)) != sec_ofs)
                    continue;
                }

              /* XC32-1656: the caller of the functions from .init_array
               *            is assumed to be the __libc_init_array function */
              if (ctors_section)
                {
                  pic32_su_add_to_call_graph (ctors_caller->the_bfd,
                                              ctors_caller->fname,
                                              ctors_caller->faddr,
                                              callee_sec->owner, callee.name,
                                              callee.addr);
                  continue;
                }

