zeha/xc32/pic32m-source/binutils/ld/mchp/pic32-su-common.c
              /* XC32-1638: calling pic32_su_get_func_name_addr () in a loop
               *            will iterate any overlapped callers */
              if (pic32_su_get_func_name_addr (&caller, input_bfd,
                                               bfd_funcs, section,
                                               irela->r_offset, TRUE))
                {
                  do
                    {
                      PIC32_DBG_PRINT ("\t\t[reloc-based] %s calls %s\n",
                                      caller.name, callee.name);

                      pic32_su_add_to_call_graph (input_bfd, caller.name,
                                                  caller.addr, callee_sec->owner,
                                                  callee.name, callee.addr);
                    }
                  while (pic32_su_get_func_name_addr (&caller, input_bfd,
                                                      bfd_funcs, section,
                                                      irela->r_offset, FALSE));
                }
              else
                {
                  PIC32_DBG_PRINT ("No function found in section %s @ ofs %"
				   BFD_VMA_FMT "u\n", section->name, irela->r_offset);
                }
            }
        }

      /* complete the function addresses left unset
       * by the pic32_su_add_to_call_graph () calls */
      pic32_fill_su_section_addrs (input_bfd, isymbuf);

      pic32_su_free_bfd_funcs (bfd_funcs);
      free (isymbuf);
    }

#ifdef TARGET_IS_PIC32MX
  /* for PIC32M, __do_global_ctors_aux () is called from _init () but...
   * we don't see that call here b/c the '_init' symbol has a size of 0 and
   * there's no way we can set it a proper size during the XC32 build as that
   * size is the result of concatenating the .init sections contents from
   * crti.o, an arbitrary number of user objs and crtn.o
   * so maybe we could look at the size of the .init output section?
   * anyway, an easier hack would be to just add __do_global_ctors_aux()
   * as a callee of _init () - which we do below... */
  if (ctors_caller)
    {
      struct su_section *_init = get_function_by_name_bfd ("_init", NULL);
      if (_init)
        pic32_su_add_to_call_graph (_init->the_bfd, _init->fname, _init->faddr,
                                    ctors_caller->the_bfd, ctors_caller->fname,
                                    ctors_caller->faddr);
    }
#endif
  return 1;
}

struct su_caller_list {
  struct su_section     *node;
  struct su_caller_list *prev, *next;
};

static void
pic32_dump_call_subgraph_1 (struct su_caller_list *caller_list)
{
  static const int SU_INFO_COL = 120;  /* dump SU info @ the same column, if possible */
  static const char *PREFIXES[][2] = {
#ifndef __MINGW32__
    { "│  ", "   " }, { "├──", "└──" } /* similar to `tree`'s output (UTF-8 encoding) */
#else
    { "|  ", "   " }, { "|--", "\\--" }/* but of course it doesn't work on Windows */
#endif                                 /* so use alternate ASCII chars */
  };

  struct su_section *node = caller_list->node;
  struct su_caller_list *root = caller_list;
  int len = 0, to_align, idx;
  char *demangled_name = NULL;

  /* 'caller_list' has at least a caller-callee pair */
  if (root->prev)
    {
      /* 'unwind' the caller list to process it from the root node/topmost caller */
      do
        root = root->prev;
      while (root->prev);

      /* for each caller-callee pair */
      /* (the last 'caller' in the list has no callees) */
      while (root->next)
        {
          struct su_section *caller = root->node, *callee = root->next->node;

          const int last_caller_callee = callee == caller->callees[caller->nb_callees - 1];
          const int last_callee_in_list = root->next->next == NULL;

          const char *prefix = PREFIXES[last_callee_in_list][last_caller_callee];

          PIC32_DBG_PRINT ("%s ", prefix);
          len += 4; /* hardcoded b/c the UTF-8 chars are seen as multiple chars */
          root = root->next;
        }
    }

  demangled_name = bfd_demangle (link_info.output_bfd, node->fname,
                                 DMGL_ANSI | DMGL_PARAMS);

  /* if available, use the demangled name, but not if it is very long */
  len += PIC32_DBG_PRINT ("%s", (demangled_name
                                   && len + (int) strlen (demangled_name) <= SU_INFO_COL)
                                 ? demangled_name : node->fname);
  free (demangled_name);

  to_align = SU_INFO_COL - len;
  if (to_align > 0)
    PIC32_DBG_PRINT ("%*s", to_align, "");

  /* print the stack usages and a '(r)' mark for the recursive calls */
  PIC32_DBG_PRINT ("%4u %4u%s\n", node->used_stack, node->max_stack,
                   ((node->flags & SU_RECURSIVE) ? " (r)" : ""));

  /* don't expand the callees more than once */
  if (node->flags & SU_EXPANDED_NODE)
    return;

  node->flags |= (SU_PROCESSED_NODE | SU_EXPANDED_NODE);

  if (node->nb_callees)
    {
      struct su_caller_list new_caller_list = { .prev = caller_list,
                                                .next = NULL };
      caller_list->next = &new_caller_list;
      for (idx = 0; idx != (int) node->nb_callees; ++idx)
        {
          new_caller_list.node = node->callees[idx];
          pic32_dump_call_subgraph_1 (&new_caller_list);
        }
      caller_list->next = NULL;
    }

  node->flags &= ~SU_PROCESSED_NODE;
}

static intptr_t
pic32_reset_processed_expanded_flags (struct su_section *node,
                                      void *param __attribute__((unused)))
{
  BFD_ASSERT (node);
  node->flags &= ~(SU_PROCESSED_NODE | SU_EXPANDED_NODE);
  return 0;
}

static void
pic32_dump_call_subgraph (struct su_section *root)
{
  struct su_caller_list caller_list = { root, NULL, NULL };
  pic32_dump_call_subgraph_1 (&caller_list);
}

/* smart-io replaces some function symbols */
typedef struct {
  char *from;
  char *to;
} su_sio_replace;

static vec_type *su_sio_replaces = NULL;

/* returns the smart-io replacement, if one exists;
 * otherwise, returns the original function name */
static const char *
su_get_smartio_replacement (const char *from)
{
  int i;

