zeha/xc32/pic32m-source/binutils/ld/mchp/pic32-su-common.c
  if (!su_sio_replaces)
    su_sio_replaces = VEC_NEW (su_sio_replace, 0, 0);

  for (i = 0; i != (int) VEC_SIZE (su_sio_replaces); ++i)
    {
      const su_sio_replace *rep = &VEC (su_sio_replace, su_sio_replaces, i);
      if (!strcmp (rep->from, from))
        return rep->to;
    }

  return from;
}

void
su_note_smartio_replacement (const char *from, const char *to)
{
  su_sio_replace tmp;

  /* if not already added */
  if (su_get_smartio_replacement (from) == from)
    {
      PIC32_DBG_PRINT ("smart-io replacement: %s -> %s\n", from, to);

      tmp.from = xstrdup (from);
      tmp.to   = xstrdup (to);

      VEC_PUSHBACK (su_sio_replace, su_sio_replaces, tmp);
    }
}

static void
su_free_smartio_replacements (void)
{
  if (su_sio_replaces)
    {
      int i;
      for (i = 0; i != (int) VEC_SIZE (su_sio_replaces); ++i)
        {
          su_sio_replace *rep = &VEC (su_sio_replace, su_sio_replaces, i);
          free (rep->from);
          free (rep->to);
        }
      VEC_DELETE (su_sio_replaces);
      su_sio_replaces = NULL;
    }
}

/*
* Stack Usage Estimation
* 	main function for stack usage estimation
* 		- stack usage estimation per function should
*		already be gathered
* 		- build the pseudo call-graph by adding link 
*		between caller-callee
*		- find the entry point of the application and 
*		compute the maximum stack usage from that point
*/
void
pic32_stack_estimation_run (void)
{
  struct su_section *root, *node;

  /* build call tree based on relocations */
  pic32_su_call_tree ();

  /* get application entry-point */
  root = pic32_su_get_entry_point ();

  /* prepare callstack */
  crt_callstack = su_cstack_new ();

  /* make sure we start with cleared SU_PROCESSED_NODE/SU_EXPANDED_NODE flags
   * for all the functions;
   *
   * SU_PROCESSED_NODE is set temporarily (reset on return) during each
   *                   pic32_su_max_stack() and pic32_dump_call_subgraph() call
   *
   * SU_EXPANDED_NODE is only set (never reset) by the
   *                  pic32_dump_call_subgraph () calls
   */
  map_over_su_sections (pic32_reset_processed_expanded_flags, NULL);

  if (root != NULL)
    {
      /* set the entry point flag so we can identify it later */
      root->flags |= SU_ENTRY_FUNC;
      root->flags &= ~SU_DISJOINT_FUNC;

      /* compute max stack usage starting from entry-point */
      pic32_su_max_stack (root);

      if (pic32_debug)
        {
          PIC32_DBG_PRINT ("==========================================\n");
          PIC32_DBG_PRINT ("App max stack usage %d\n", root->max_stack);
          PIC32_DBG_PRINT ("==========================================\n");
          pic32_dump_call_subgraph (root);
          PIC32_DBG_PRINT ("\n");
        }
    }

  /* check that callstack is in good shape (empty) */
  if (!su_cstack_is_empty (crt_callstack))
    PIC32_DBG_PRINT ("Error: Callstack not empty!\n");

  /* compute max stack usage for the rest of root functions */
  for (node = su_sections; node != NULL; node = node->next)
    {
      if (node == root || (node->flags & SU_DISCARDED_NODE))
        continue;

      if (node->flags & (SU_INTERRUPT | SU_DISJOINT_FUNC))
        {
          pic32_su_max_stack (node);

          if (pic32_debug)
            {
              PIC32_DBG_PRINT ("==========================================\n");
              PIC32_DBG_PRINT ("Interrupt/disjoint fn <%s> stack usage %d\n",
                               node->fname, node->max_stack);
              PIC32_DBG_PRINT ("==========================================\n");
              pic32_dump_call_subgraph (node);
              PIC32_DBG_PRINT ("\n");
            }
        }
    }

  /* print the stack usage report */
  pic32_print_su_report (stdout);

  /* if we have the map file, also dump the report there */
  if (config.map_file)
    pic32_print_su_report (config.map_file);

  /* work done for stack usage 
   * time to clean up
   */
  su_cstack_free (crt_callstack);
  free_su_sections ();
  su_free_smartio_replacements ();
}
